# -*- coding: utf-8 -*-

beits = [
u'ای رستخیز ناگهان وی رحمت بی‌منتها',
u'ای طایران قدس را عشقت فزوده بال‌ها',
u'ای دل چه اندیشیده‌ای در عذر آن تقصیرها',
u'ای یوسف خوش نام ما خوش می‌روی بر بام ما',
u' آن شکل بین وان شیوه بین وان قد و خد و دست و پا',
u'بگریز ای میر اجل از ننگ ما از ننگ ما',
u'بنشسته‌ام من بر درت تا بوک برجوشد وفا',
u'جز وی چه باشد کز اجل اندررباید کل ما',
u'من از کجا پند از کجا باده بگردان ساقیا',
u'مهمان شاهم هر شبی بر خوان احسان و وفا',
u' ای طوطی عیسی نفس وی بلبل شیرین نوا',
u'ای نوبهار عاشقان داری خبر از یار ما',
u'ای باد بی‌آرام ما با گل بگو پیغام ما',
u'ای عاشقان ای عاشقان امروز ماییم و شما',
u'ای نوش کرده نیش را بی‌خویش کن باخویش را',
u'ای یوسف آخر سوی این یعقوب نابینا بیا',
u'آمد ندا از آسمان جان را که بازآ الصلا',
u' ای یوسف خوش نام ما خوش می‌روی بر بام ما',
u'امروز دیدم یار را آن رونق هر کار را',
u'چندانک خواهی جنگ کن یا گرم کن تهدید را',
u'جرمی ندارم بیش از این کز دل هوا دارم تو را',
u'چندان بنالم ناله‌ها چندان برآرم رنگ‌ها',
u'چون خون نخسپد خسروا چشمم کجا خسپد مها',
u'چون نالد این مسکین که تا رحم آید آن دلدار را',
u'من دی نگفتم مر تو را کای بی‌نظیر خوش لقا',
]



import xml.etree.ElementTree as ET

def extract_poem(index):
	a = []
	tree = ET.parse('Poem.xml')
	root = tree.getroot()
	for poem in root:
		if int(poem.get('name')) == index:
			for beit in poem:
				a.append(beit.text)
	ans = []
	for i in range(len(a)/2):
		ans.append((a[2*i],a[2*i+1]))
	return ans

